org/roam/linux.org
:PROPERTIES:
:ID:       9e9bcdb8-ac35-4420-a2c0-c32b96cb4803
:END:
#+title: linux
#+OPTIONS: toc:nil num:nil date:nil \n:nil html-style:nil author:nil timestamp:nil title:nil html-postamble:nil html5-fancy:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-default.css" />
#+HTML_CONTENT_CLASS: container content
#+HTML_DOCTYPE: html5
#+INCLUDE: "css.org::navbar" :only-contents t

* Linux
Finally some hardware support!
** [[id:1545c3b7-0dff-4196-b73b-7fce0518b6af][linux-distros]]
** Kernel
- removed sysctl system call in 5.5
- io-uring
  - io-uring-spawn for process launching
- ~/proc/cpuinfo~  for model
- abi tracker https://abi-laboratory.pro/?view=timeline&l=linux
** pam
** misc
- ~faillock --user $USER --reset~ for attempt reset
- ~LD_LIBRARY_PATH~ and ~LD_PRELOAD~ environment variables override library location and load order respectively.
  - ~LD_DEBUG=libs~ to monitor ~dlopen~ (redirect stderr for cli ~2>err.txt~)
  - ~readelf -d~ to check the dynamic section of the elf for ~rpath~ (searched before library path) or ~runpath~ (searched after library path) or ~FLAGS~ such as ~NODEFLIB~
    - each shared lib is searched for in the following order:  rpath, libary path, runpath, ld cache, system lib (skipped if compiled with ~ld -z nodefaultlib~)
- strace for system call debugging
- ~smartctl~ or ~gsmartcontrol~ and ~nvme smart-log /dev/nvme0~ for disk stats
