docs/linux.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>linux</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container content">
<nav class="navbar is-black" id="org2faffc8">
<div class="navbar-brand" id="org27360b1">
<div class="navbar-item" id="orgee67083">
<p>
<a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a>
</p>

</div>

</div>
<div class="navbar-menu" id="org6212d7b">
<div class="navbar-start" id="org3345951">
<div class="navbar-item" id="orgbdaa08a">
<p>
<a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a>
</p>

</div>

</div>
<div class="navbar-end" id="orgc994469">

</div>

</div>
</nav>

<div id="outline-container-org5b28eba" class="outline-2">
<h2 id="org5b28eba">Linux</h2>
<div class="outline-text-2" id="text-org5b28eba">
<p>
Finally some hardware support!
</p>
</div>
<div id="outline-container-org25d1cfb" class="outline-3">
<h3 id="org25d1cfb"><a href="linux_distros.html#ID-1545c3b7-0dff-4196-b73b-7fce0518b6af">linux-distros</a></h3>
</div>
<div id="outline-container-org18aa0d6" class="outline-3">
<h3 id="org18aa0d6">Kernel</h3>
<div class="outline-text-3" id="text-org18aa0d6">
<ul class="org-ul">
<li>removed sysctl system call in 5.5</li>
<li>io-uring
<ul class="org-ul">
<li>io-uring-spawn for process launching</li>
</ul></li>
<li><code>/proc/cpuinfo</code>  for model</li>
<li>abi tracker <a href="https://abi-laboratory.pro/?view=timeline&amp;l=linux">https://abi-laboratory.pro/?view=timeline&amp;l=linux</a></li>
</ul>
</div>
</div>
<div id="outline-container-orge15f881" class="outline-3">
<h3 id="orge15f881">pam</h3>
</div>
<div id="outline-container-org2512a07" class="outline-3">
<h3 id="org2512a07">misc</h3>
<div class="outline-text-3" id="text-org2512a07">
<ul class="org-ul">
<li><code>faillock --user $USER --reset</code> for attempt reset</li>
<li><code>LD_LIBRARY_PATH</code> and <code>LD_PRELOAD</code> environment variables override library location and load order respectively.
<ul class="org-ul">
<li><code>LD_DEBUG=libs</code> to monitor <code>dlopen</code> (redirect stderr for cli <code>2&gt;err.txt</code>)</li>
<li><code>readelf -d</code> to check the dynamic section of the elf for <code>rpath</code> (searched before library path) or <code>runpath</code> (searched after library path) or <code>FLAGS</code> such as <code>NODEFLIB</code>
<ul class="org-ul">
<li>each shared lib is searched for in the following order:  rpath, libary path, runpath, ld cache, system lib (skipped if compiled with <code>ld -z nodefaultlib</code>)</li>
</ul></li>
</ul></li>
<li>strace for system call debugging</li>
<li><code>smartctl</code> or <code>gsmartcontrol</code> and <code>nvme smart-log /dev/nvme0</code> for disk stats</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>